In [1]:
import sqlite3
import pandas as pd

connection = sqlite3.connect('books.db')
pd.options.display.max_columns = 10

In [2]:
pd.read_sql_query('SELECT last FROM authors ORDER BY last DESC', connection)

     last
0    Wald
1   Quirk
2  Deitel
3  Deitel
4  Deitel

In [3]:
pd.read_sql_query('SELECT title FROM titles ORDER BY title ASC', connection)

                              title
0         Android 6 for Programmers
1            Android How to Program
2                  C How to Program
3                C++ How to Program
4     Internet & WWW How to Program
5     Intro to Python for CS and DS
6               Java How to Program
7  Visual Basic 2012 How to Program
8          Visual C# How to Program
9         Visual C++ How to Program

In [4]:
pd.read_sql_query("""SELECT t.title, t.copyright, t.isbn
                     FROM titles t
                     INNER JOIN author_ISBN ai ON ai.isbn = t.isbn
                     WHERE ai.id = 2
                     ORDER BY t.title """, connection)

                              title copyright        isbn
0         Android 6 for Programmers      2016  0134289366
1            Android How to Program      2017  0134444302
2                  C How to Program      2016  0133976890
3                C++ How to Program      2017  0134448235
4     Internet & WWW How to Program      2012  0132151006
5     Intro to Python for CS and DS      2020  0135404673
6               Java How to Program      2018  0134743350
7  Visual Basic 2012 How to Program      2014  0133406954
8          Visual C# How to Program      2017  0134601548
9         Visual C++ How to Program      2008  0136151574

In [5]:
cursor = connection.cursor()
cursor = cursor.execute("""INSERT INTO authors(first, last)
                           VALUES('Josh', 'Holsclaw')""")
print(cursor.rowcount)

1

In [6]:
cursor = cursor.execute("""INSERT INTO titles(isbn, title, edition, copyright)
                           VALUES('123456', 'Test Book', 1, '2024')""")

print(cursor.rowcount)

cursor = cursor.execute("""INSERT INTO author_ISBN(id, isbn)
                           VALUES(6, '123456')""")

print(cursor.rowcount)

1
1

In [7]:
pd.read_sql_query("""SELECT a.id,
                            a.first,
                            a.last,
                            t.isbn,
                            t.title,
                            t.edition,
                            t.copyright
                     FROM authors a
                     JOIN author_ISBN ai ON ai.id = a.id
                     JOIN titles t ON t.isbn = ai.isbn
                     WHERE a.id = 6""", connection)

   id first      last    isbn      title  edition copyright
0   6  Josh  Holsclaw  123456  Test Book        1      2024

In [8]:
connection.close()